import TopPageBackground from "@/components/TopPageBackground";
import Share from "../components/share";
import TitleSection from "@/components/TitleSection";
import CardGlobal from "@/components/CardGlobal";
import BlogCart from "../components/BlogCart";
import Link from "next/link";
import Sidebar from "../components/Sidebar";

type IPropsArticle = {
  params: Promise<{ id: string }>;
}

const article = async (Props: IPropsArticle) => {

  const { id } = await Props.params;

  console.log(id)

  return (
    <>
      <div className="text-primary text-sm flex justify-center translate-y-4 md:translate-y-24">
        <Link href="/">
          <span className="px-3 cursor-pointer">پدر بزرگ</span>
        </Link>/
        <Link href="/blog">
          <span className="px-3 cursor-pointer">بلاگ</span>
        </Link>/
        <span className="px-3 cursor-pointer">سبک زندگی</span>
      </div>
      <TopPageBackground name="از روغن ماساژ در پخت و پز استفاده نکنید" />

      <div className="xl:flex mb-60 md:mb-32 xl:gap-x-4">
        <main className="xl:flex-1">

          <div className="flex flex-col gap-y-4">
            <img src="/images/article-image.svg" alt="عکس مقاله" className="w-full -mt-4 md:mt-5" />

            <div className="flex md:items-center justify-end">
              <span className="flex ml-1 md:ml-2">
                <span className="text-[10px] md:text-xs text-text-gray ml-[1px] md:ml-1">&apos;۳</span>
                <img src="/icons/clock.svg" alt="" className="w-3 h-3 md:w-[18px] md:h-[18px]" />
              </span>
              <span className="flex md:items-center">
                <span className="text-[10px] md:text-xs text-text-gray ml-[1px] md:ml-1">۱۴۰۶/۰۹/۰۳</span>
                <img src="/icons/calendar-2.svg" alt="" className="w-3 h-3 md:w-[18px] md:h-[18px]" />
              </span>
            </div>
            <p className="text-justify leading-[180%] text-article">
              پیوسته تا با، با، با هدف در زبان فارسی  پیوسته از چاپگرها شناخت متخصصان طراحان خلاقی دنیای  و زمان اساسا استفاده می طلبد از ساختگی تا با،  و زمان بیشتری را متنوع زیادی لازم و آینده در با هدف لازم لورم و طراحان ارائه اهل قرار گیرد تایپ متنوع در و برای سادگی و مجله ارائه حال اهل استفاده از اصلی و کتابهای کتابهای طراحان تکنولوژی علی الخصوص  تکنولوژی رایانه ای اصلی و برای سخت تمام را از تکنولوژی می توان زیادی روزنامه. با هدف صنعت و حال متخصصان زیادی در لورم سخت در شناخت است متن سادگی روزنامه. فعلی که، طراحان خلاقی جامعه موجود و کاربردهای است مورد تا با، صنعت را و و بیشتری را می توان مورد نیاز است و فرهنگ پیشرو جامعه مورد نیاز به پایان ابزارهای کاربردی ارائه برای چاپ ستون چاپ طراحان خلاقی است در رایانه ای بلکه تکنولوژی بیشتری را زیادی بهبود و متون در تا با، قرار گیرد و متون کتابهای ایجاد طراحان ایپسوم داشت در این صورت را روزنامه. تولید طراحان  و زمان شرایط ستون بلکه و لازم است اصلی امید
            </p>

            <div className="text-primary p-4 bg-secondarytwo leading-[140%] rounded-2xl flex flex-col gap-y-4">
              <h2 className="text-xl text-center">آنچه در این مطلب می‌خوانید</h2>
              <div className="flex items-center gap-x-2">
                <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
                <p>و مجله و مجله و سطر که ستون طراحان طراحان خلاقی حروفچینی مورد امید اصلی شناخت استفاده نرم افزارها چاپ</p>
              </div>
              <div className="flex items-center gap-x-2">
                <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
                <p>می باشد  و زمان طراحان خلاقی اهل موجود متخصصان بهبود می طلبد فراوان در موجود می طلبد دستاوردهای دستاوردهای چاپ</p>
              </div>
              <div className="flex items-center gap-x-2">
                <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
                <p>و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</p>
              </div>
              <div className="flex items-center gap-x-2">
                <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
                <p>شصت و سه درصد حروفچینی با، ستون قرار گیرد داشت با، متن زیادی شرایط متن شناخت بیشتری را گذشته سخت</p>
              </div>
              <div className="flex items-center gap-x-2">
                <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
                <p>متن جامعه و با و متون را اصلی فعلی نرم افزارها راهکارها حال ایجاد است متن فراوان اهل</p>
              </div>
            </div>

            <h2 className="text-center text-xl text-primary">و مجله و مجله و سطر که ستون طراحان طراحان خلاقی حروفچینی مورد امید اصلی شناخت استفاده نرم افزارها چاپ</h2>
            <p className="text-justify leading-[180%] text-article">
              مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
            </p>
            <h2 className="text-xl text-primary">می باشد  و زمان طراحان خلاقی اهل موجود متخصصان بهبود می طلبد فراوان در موجود می طلبد دستاوردهای دستاوردهای چاپ</h2>
            <img src="/images/Frame 147.svg" alt="عکس دوم مقاله" />
            <p className="text-justify leading-[180%] text-article">
              مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
            </p>
            <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
            <p className="text-justify leading-[180%] text-article">
              مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
            </p>
            <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
            <p className="text-justify leading-[180%] text-article">
              مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
            </p>
            <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
            <p className="text-justify leading-[180%] text-article">
              مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
            </p>
          </div>
          <Share />

          <div className="mb-16">
            <TitleSection title="محصولات پیشنهادی پدربزرگ" />
            <div className="overal-products gap-2 md:gap-4 my-4 lg:my-8">
              {Array(4).fill(1).map((_, index) =>
                <CardGlobal key={index} id={index + 1} />
              )}
            </div>
            <Link href="/products" className="flex justify-center">
              <button className="text-white bg-primary transition-colors duration-300 hover:bg-hover-btn rounded-lg px-4 py-2">مشاهده همه محصولات</button>
            </Link>
          </div>

          <div>
            <TitleSection title="مقالات مرتبط" />
            <div className="overal-blogs-suggest gap-2 md:gap-4 my-4 lg:my-8">
              {Array(9).fill(1).map((_, index) =>
                <BlogCart key={index} />
              )}
            </div>
            <Link href="/blog" className="flex justify-center">
              <button className="text-white transition-colors duration-300 hover:bg-hover-btn bg-primary rounded-lg px-4 py-2">مشاهده همه مقالات</button>
            </Link>
          </div>
        </main>
        <Sidebar />
      </div>
    </>
  )
}

export default article