import TopPageBackground from "@/components/TopPageBackground";

type IPropsArticle = {
  params: Promise<{ id: string }>;
  searchParams: Promise<{}>;
}

const article = async (Props: IPropsArticle) => {

  const { id } = await Props.params;

  return (
    <div className="mb-56">
      <main className="">

        <div className="text-primary text-sm flex justify-center translate-y-4 md:translate-y-24">
          <span className="px-3 cursor-pointer">پدر بزرگ</span>/
          <span className="px-3 cursor-pointer">بلاگ</span>/
          <span className="px-3 cursor-pointer">سبک زندگی</span>
        </div>

        <TopPageBackground name="از روغن ماساژ در پخت و پز استفاده نکنید" />

        <div className="flex flex-col gap-y-4">
          <img src="./images/article-image.svg" alt="عکس مقاله" className="w-full -mt-4 md:mt-5" />

          <div className="flex md:items-center justify-end">
            <span className="flex ml-1 md:ml-2">
              <span className="text-[10px] md:text-xs text-text-gray ml-[1px] md:ml-1">'۳</span>
              <img src="./icons/clock.svg" alt="" className="w-3 h-3 md:w-[18px] md:h-[18px]" />
            </span>
            <span className="flex md:items-center">
              <span className="text-[10px] md:text-xs text-text-gray ml-[1px] md:ml-1">۱۴۰۶/۰۹/۰۳</span>
              <img src="./icons/calendar-2.svg" alt="" className="w-3 h-3 md:w-[18px] md:h-[18px]" />
            </span>
          </div>
          <p className="text-justify leading-[180%] text-article">
            پیوسته تا با، با، با هدف در زبان فارسی  پیوسته از چاپگرها شناخت متخصصان طراحان خلاقی دنیای  و زمان اساسا استفاده می طلبد از ساختگی تا با،  و زمان بیشتری را متنوع زیادی لازم و آینده در با هدف لازم لورم و طراحان ارائه اهل قرار گیرد تایپ متنوع در و برای سادگی و مجله ارائه حال اهل استفاده از اصلی و کتابهای کتابهای طراحان تکنولوژی علی الخصوص  تکنولوژی رایانه ای اصلی و برای سخت تمام را از تکنولوژی می توان زیادی روزنامه. با هدف صنعت و حال متخصصان زیادی در لورم سخت در شناخت است متن سادگی روزنامه. فعلی که، طراحان خلاقی جامعه موجود و کاربردهای است مورد تا با، صنعت را و و بیشتری را می توان مورد نیاز است و فرهنگ پیشرو جامعه مورد نیاز به پایان ابزارهای کاربردی ارائه برای چاپ ستون چاپ طراحان خلاقی است در رایانه ای بلکه تکنولوژی بیشتری را زیادی بهبود و متون در تا با، قرار گیرد و متون کتابهای ایجاد طراحان ایپسوم داشت در این صورت را روزنامه. تولید طراحان  و زمان شرایط ستون بلکه و لازم است اصلی امید
          </p>

          <div className="text-primary p-4 bg-secondarytwo leading-[140%] rounded-2xl flex flex-col gap-y-4">
            <h2 className="text-xl text-center">آنچه در این مطلب می‌خوانید</h2>
            <div className="flex items-center gap-x-2">
              <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
              <p>و مجله و مجله و سطر که ستون طراحان طراحان خلاقی حروفچینی مورد امید اصلی شناخت استفاده نرم افزارها چاپ</p>
            </div>
            <div className="flex items-center gap-x-2">
              <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
              <p>می باشد  و زمان طراحان خلاقی اهل موجود متخصصان بهبود می طلبد فراوان در موجود می طلبد دستاوردهای دستاوردهای چاپ</p>
            </div>
            <div className="flex items-center gap-x-2">
              <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
              <p>و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</p>
            </div>
            <div className="flex items-center gap-x-2">
              <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
              <p>شصت و سه درصد حروفچینی با، ستون قرار گیرد داشت با، متن زیادی شرایط متن شناخت بیشتری را گذشته سخت</p>
            </div>
            <div className="flex items-center gap-x-2">
              <span className="bg-circle rounded-2xl w-2.5 h-2.5"></span>
              <p>متن جامعه و با و متون را اصلی فعلی نرم افزارها راهکارها حال ایجاد است متن فراوان اهل</p>
            </div>
          </div>

          <h2 className="text-center text-xl text-primary">و مجله و مجله و سطر که ستون طراحان طراحان خلاقی حروفچینی مورد امید اصلی شناخت استفاده نرم افزارها چاپ</h2>
          <p className="text-justify leading-[180%] text-article">
            مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
          </p>
          <h2 className="text-xl text-primary">می باشد  و زمان طراحان خلاقی اهل موجود متخصصان بهبود می طلبد فراوان در موجود می طلبد دستاوردهای دستاوردهای چاپ</h2>
          <img src="./images/Frame 147.svg" alt="عکس دوم مقاله" />
          <p className="text-justify leading-[180%] text-article">
            مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
          </p>
          <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
          <p className="text-justify leading-[180%] text-article">
            مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
          </p>
          <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
          <p className="text-justify leading-[180%] text-article">
            مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
          </p>
          <h2 className="text-xl text-primary">و و کاربردهای طراحان است شناخت اصلی با هدف که، تمام می باشد بهبود متن با، حال اصلی</h2>
          <p className="text-justify leading-[180%] text-article">
            مورد متنوع تکنولوژی لورم آنچنان طراحی از شرایط امید آنچنان و روزنامه. و مجله شامل صنعت ساختگی که، آنچنان اصلی و سطر می طلبد شامل پیوسته مورد می باشد چاپگرها و با شناخت با هدف استفاده می توان و مجله شرایط را طراحان علی الخصوص  تمام و کاربردهای در ارائه کتابهای و کاربردهای حال به پایان شرایط برای شرایط تایپ گذشته متخصصان برای طراحان  و زمان گذشته مورد حال طراحان تمام پیوسته روزنامه. تولید را کتابهای سوالات موجود لازم تکنولوژی در زبان فارسی  ستون در در در زبان فارسی  امید و متن مورد مورد نیاز حروفچینی در زبان فارسی  بهبود داشت چاپ امید و آینده و فرهنگ پیشرو ستون ایپسوم موجود در را می باشد و دشواری لورم می توان فعلی موجود سخت لازم در زبان فارسی  تکنولوژی حال را  و زمان در و برای را داشت برای است بلکه داشت جوابگوی متخصصان جامعه برای می باشد شناخت داشت سادگی در این صورت و سطر فعلی از چاپ ساختگی طراحان خلاقی چاپ می توان و علی الخصوص  و سطر در و مجله طراحان فعلی
          </p>
        </div>

        <div className="my-16 flex flex-col gap-y-4">
          <div className="flex items-center gap-x-2">
            <span className="text-text-gray">اشتراک گذاری:</span>
            <div className="flex gap-x-1 sm:gap-x-2">
              <img src="./icons/twitter.svg" alt="ایکس" className="w-8 h-8 cursor-pointer" />
              <img src="./icons/instagram.svg" alt="اینستاگرام" className="w-8 h-8 cursor-pointer" />
              <img src="./icons/linkedin.svg" alt="لینکدین" className="w-8 h-8 cursor-pointer" />
              <img src="./icons/eitaa-svgrepo-com 1.svg" alt="ایتا" className="w-7 h-7 cursor-pointer" />
              <img src="./icons/telegram.svg" alt="تلگرام" className="w-8 h-8 cursor-pointer" />
            </div>
          </div>

          <div className="flex items-center gap-x-2">
            <span className="text-text-gray whitespace-nowrap">لینک مطلب:</span>
            <div className="overflow-x-hidden flex justify-end">
              <h3 className="text-primary py-1 px-2 rounded-lg bg-secondarytwo whitespace-nowrap">Https://dllsdjkwjddddddddddddddddddddddddddddddek.com</h3>
            </div>
            <img src="./icons/copy.svg" alt="کپی کردن" className="p-1.5 bg-secondarytwo rounded-lg w-8 h-8 cursor-pointer" />
          </div>

          <div className="flex items-center gap-x-2">
            <span className="text-text-gray">برچسب‌ها:</span>
            <div className="flex flex-wrap gap-2">
              {Array(6).fill(1).map((_, item) =>
                <span key={item} className="text-primary bg-secondarytwo px-2 py-1.5 rounded-lg">روغن</span>
              )}
            </div>
          </div>
        </div>

      </main>
      <aside className="hidden">
        <img src="./images/Products Banner 1.svg" alt="بنر محصولات" />
      </aside>
    </div>
  )
}

export default article